{

	"Instr_Typ_cap":	[	"With the opcode representing the instruction, rs and rt the source registers and rd the destination register and funct representing a function for the ALU. The R-type instruction processes the two source registers in the ALU. The ALU result is saved in the destination register specified by rd.\\\\ \n",

					"With the opcode representing the instruction and the address being part of a 32 bit address. The 32 bit address is constructed by using the first four bits of the program counter as most significant bits, concatenating the 26 bit address from the J-type instruction and setting the two least significant bits to 0.\\\\ \n",

					"With the opcode representing the instruction, rs a source register and IMM the immediate value. The usage of rt depends on the instruction, see below for details.\\\\ \n"
				],


	"instruction_names":	[	"add",
	               			"sub",
	               			"and",
	               			"or",
	               			"xor",
	               			"nor",
	               			"slt",
	              			"j",
	               			"lw",
	               			"sw",
	               			"addi",
	               			"beq",
	               			"bne"
				],


	"instruction_table_text":	[	"add         & 000000 & 100000 & R  \\\\",
						 "sub         & 000000 & 100010 & R  \\\\",
					 	"and         & 000000 & 100100 & R  \\\\",
					 	"or          & 000000 & 100101 & R  \\\\",
					 	"xor         & 000000 & 100110 & R  \\\\",
					 	"nor         & 000000 & 100111 & R  \\\\",
					 	"slt         & 000000 & 101010 & R  \\\\",
					 	"j           & 000010 &    -   & J  \\\\",
					 	"lw          & 100011 &    -   & I  \\\\",
					 	"sw          & 101011 &    -   & I  \\\\",
					 	"addi        & 001000 &    -   & I  \\\\",
					 	"beq         & 000100 &    -   & I  \\\\",
					 	"bne         & 000101 &    -   & I  \\\\"
					],

	"ALUControls":	[	"000        & add \\\\",
		   		"010        & sub \\\\",
		   		"100        & and \\\\",
		   		"101        & or  \\\\",
		   		"110        & xor \\\\",
		   		"111        & nor \\\\",
		   		"001        & slt \\\\"
			],


	"instruction_text":	[	"This instruction performs an ALU operation with two register values and saves the result to a register. It takes two clock cycles. First the registers specified in rs and rt are loaded into the ALU and the ALU is sent the %instruction_name control signal. %slt_explanation The ALUControl signal for %instruction_name can be found in Table~1. In the next clock cycle the ALU Result is saved into the register specified by rd.",

					"This instruction performs an unconditional jump to the address specified in the instruction. It takes one clock cycle. During this clock cycle the bits 25 -- 0 of the instruction are shiftet left by 2 bits. They are then used as the bits 27 -- 0 of the new program counter value (PC') together with bits 31 -- 28 of the current program counter value (PC).",

					"This instruction loads a data word from data memory into the registers. It takes three clock cycles. First the data memory address is being determined by addition in the ALU. The operands for the ALU are the register specified in rs and an immediate value specified in bits 15 -- 0 of the instruction. During the next clock cycle the result of the ALU is used as a read address from the data memory. In the third clock cycle the data read from data memory is written to the register specified by rt.",

					"This instruction stores a data word from the registers into data memory. It takes two clock cycles. First the data memory address is being calculated by addition in the ALU. The operands for the ALU are the register specified in rs and an immediate value specified in bits 15 -- 0 of the instruction. During the next clock cycle the result of the ALU is used as a write address for the data memory. The written data comes from the register specified by rt.",

					"This instruction performs an addition using the ALU with a register value and an immediate value. It takes two clock cycles. First the register value specified in rs and the immediate value are added in the ALU. In the next clock cycle the ALU Result is saved into the register specified by rt.",

					"This instruction compares two registers and on equality branches to an address derived from the immediate value. It takes only one clock cycle, but as mentioned above, the branching address has to be prepared already while decoding. Then in the clock cycle after decoding a beq instruction, registers specified by rs and rt are compared on equality by substraction in the ALU. If the ALU operation result is zero, then it sets its Zero output to `1'. The control unit has asynchronous logic which sets the PCWrite signal to `1' in case the Zero flag is `1' during the beq instruction. This writes a new value to the PC register, and thus performs the branching.",

					"This instruction compares two registers and if they are not equal, branches to an address specified in the immediate value. It takes only one clock cycle, but as mentioned above, the branching address has to be prepared already while decoding. Then in the clock cycle after decoding a bne instruction, registers specified by rs and rt are compared on equality by substraction in the ALU. If the ALU operation result is zero, then it sets its Zero output to `1'. The control unit has asynchronous logic which sets the PCWrite signal to `1' in case the Zero flag is not `1' during the bne instruction. This writes a new value to the PC register, and thus performs the branching."
				],


	"Instr_Text_helpers": 	[	 "The slt ALUControl signal compares the two ALU operands, and sets the ALU Result to 1 in case rs $<$ rt. The ALU Result is set to 0 otherwise.",
					"Because the instruction might be a ",
					"beq/bne",
					"beq",
					"bne",
					" instruction which might lead to a branch to a new program counter value, this new program counter value has to be calculated during the decode clock cycle. This means during decode the current PC value has to be added to the potential immediate value in the ALU. The potential immediate value has to be shifted left by 2 Bits beforehand. This makes the branching address available in the register which saves the ALU Result."
				]
}
